const testmode = true;
var testindex = 0;
var score = 0;
var answered = [];

const questions = [
	{
		"question": "النواة التركيب يحيط بالخلية ويساعد على ضبط ما يدخل الى الخلية او يخرج منها هو",
		"answers": [
			["الغشاء البلازمي", true],
			["الرايبوسومات", false],
			["الشبكة الإندوبلازمية", false],
			["مادة الإنزيم المتفاعلة", false],
		],		
	},
	{
		"question": "العضيات هي جزيئات البناء الأساسية في المخلوقات الحية",
		"answers": [
			["خلية كبد من فأر", false],
			["المادة الكروماتينية ", false],
			["المركبات الكربونية", true],
			["الثقوب النووية", false],
		],		
	},
	{
		"question": "...... تعد الجزيء التركيبي الأساسي الذي يكون الغشاء البلازمي",
		"answers": [
			["الميتوكندريا", false],
			["الدهون المفسفرة", true],
			["الاملاح المعدنية", false],
			["الأيونات", false],
		],		
	},
	{
		"question": "أي التراكيب الآتية تتوقع أن تجد فيها الجدار الخلوي",
		"answers": [
			["خلية من جلد الانسان", false],
			["خلية من شجرة البلوط", true],
			["خلية دم من قطة", false],
			["خلية كبد من فأر", false],
		],		
	},
	{
		"question": "ما التركيب الذي يصنع البروتينات التي تستخدمها الخلية",
		"answers": [
			["المادة الكروماتينية", false],
			["الرايبوسومات", true],
			["النوية", false],
			["الثقوب النووية", false],
		],		
	},
	{
		"question": "اين تنتج الرايبوسومات",
		"answers": [
			["الثقب النووي", false],
			["المادة الكروماتينية", false],
			["النوية", true],
			["الشبكة الإندوبلازمية", false],
		],		
	},
	{
		"question": "أي مما يأتي مادة تقلل من طاقة التنشيط",
		"answers": [
			["الايون", false],
			["المحفز", true],
			["المواد المتفاعلة", false],
			["مادة الإنزيم المتفاعلة", false],
		],		
	},
	{
		"question": "ما العناصر التي توجد في الاحماض الأمينية",
		"answers": [
			["النيتروجين والكبريت", false],
			["الكربون و الأكسجين", true],
			["الهيدروجين والفوسفور", false],
			["الكبريت و الاكسجين", false],
		],		
	},
	{
		"question": "ما الذي يربط الأحماض الأمينية بعضها مع بعض",
		"answers": [
			["الروابط الببتيدية", true],
			["قوى فان درقال", false],
			["الروابط الهيدروجينية", false],
			["الروابط الأيونية", false],
		],		
	},
	{
		"question": "ما المادة التي لاتعد جزاء من النيوكليوتيدات",
		"answers": [
			["الفوسفات", false],
			["السكر", false],
			["القاعدة النيتروجينية", false],
			["الماء", true],
		],
	},
	{
		"question": "ما الذي يسهم في النفاذية الاختيارية للغشاء الخلوي ",
		"answers": [
			["الكربوهيدرات", false],
			["الاملاح المعدنية", false],
			["الأيونات", false],
			["البروتينات", true],
		],
	},
	{
		"question": "أي مما يأتي ليس من خصائص الطاقة",
		"answers": [
			["لا يمكن ان تفنى أو تستحدث إلا بمشيئة الله", false],
			["القدرة على قيام بالعمل", false],
			["توجد بأشكال عدة منها الكيميائية الضوئية والميكانيكية", false],
			["تتغير تلقائيا من عشوائية إلى منظمة", true],
		],		
	},
	{
		"question": "أي المخلوقات الحية الآتية تعتمد على مصادر خارجية للمركبات العضوية",
		"answers": [
			["الذاتية التغذي", false],
			["غير ذاتية التغذي", true],
			["الذاتية التغذي الكيميائية", false],
			["الذاتية التغذي الضوئية", false],
		],		
	},
	{
		"question": "ما الذي تخزنه الخلايا وتطلقه بوصفه مصدرا رئيسا للطاقة الكيميائية",
		"answers": [
			["ATP", true],
			["NADP+", false],
			["ADP+", false]
			["NADPH", false],
		],		
	},
	{
		"question": "إي مما يأتي يمثل الغشاء الداخلي للبلاستيدة الخضراء المنظم في صورة أكياس غشائية مسطحة ",
		"answers": [
			["الثايلاكويد", true],
			["الميتوكندريا", false],
			["الكيس (الغمد)", false],
			["الحشوة", false],
		],		
	},
	{
		"question": "ما مصدر الطاقة اللازمة لبناء الكربوهيدرات في أثناء حلقة كالفن",
		"answers": [
			["ATBوCO2", false],
			["H2oوNADPH", false],
			["NADPHوATB", true],
			["O2وH2O", false],
		],		
	},
	{
		"question": "أي مما يأتي لا يعد من مراحل التنفس الخلوي",
		"answers": [
			["التحلل السكري", false],
			["سلسلة نقل الإلكترون", false],
			["حلقة كربس", false],
			["تخمر حمض اللاكتيك", true],
		],		
	},
	{
		"question": "ما الذي ينتج عند مغادرة الإلكترونات سلسلة نقل الإلكترون في التنفس الخلوي وارتباطها مع المستقبل النهائي للإلكترونات في السلسلة",
		"answers": [
			["H2O", true],
			["CO2", false],
			["O2", false],
			["CO", false],
		],		
	},
	{
		"question": "في نهاية عملية التحلل السكري ما الجزيء الذي يتم فيه تخزين معظم الطاقة الناتجة عن الجلوكوز",
		"answers": [
			["البيروفيت", true],
			["استيل CoA", false],
			["ATP", false],
			["NADH", false],
		],		
	},
	{
		"question": "بناء على نسبة مساحة السطح إلى الحجم ماذا تمثل مساحة السطح في الخلية",
		"answers": [
			["النواة", false],
			["الميتوكندريا", false],
			["الغشاء البلازمي", true],
			["السيتوبلازم", false],
		],		
	},
	{
		"question": "أي مما يأتي يصف نشاطات الخلية التي تضم النمو الخلوي وانقسام الخلية",
		"answers": [
			["الكروماتين", false],
			["الانقسام المتساوي", false],
			["السيتوبلازم", false],
			["دورة الخلية", true],
		],		
	},
	{
		"question": "ماذا يحدث لنسبة مساحة سطح الخلية كلما زاد حجم الخلية",
		"answers": [
			["تزداد", false],
			["تبقى كما هي", false],
			["تقل", true],
			["تصل إلى حدها الأقصى", false],
		],		
	},
	{
		"question": "ما دور البروتينات الحلقية في الخلية",
		"answers": [
			["تنظم حركة الأنيبيات الدقيقة", false],
			["تعطي الإشارة لبدء انقسام الخلية", true],
			["تحفز تحلل الغلاف النووي", false],
			["تسبب اختفاء النوية", false],
		],		
	},
	{
		"question": "ما المواد التي تشكل مجموعة الإنزيم -البروتين الحلقي/ CDk- والتي تتحكم في مراحل دورة الخلية",
		"answers": [
			["الدهون والبروتينات", false],
			["البروتينات ولإنزيمات", true],
			["الكربوهيدرات", false],
			["الدهون والإنزيمات و البروتينات", false],
		],		
	},
	{
		"question": "أي مما يأتي من خصائص الخلايا السرطانية",
		"answers": [
			["انقسام خلوي منظم", false],
			["تحتوي تغيرات عديدة في المادة الوراثية", true],
			["لا يحدث لها انقسام السيتوبلازم", false],
			["البروتين الحلقي فيها يقوم بوظائفه", false],
		],		
	},
	{
		"question": "ما عدد الكروسومات في خلية تمر با لطيور الاستوائي الأول من الانقسام المنصف إذا كانت تحتوي 12 كروموسوما في أثناء الطور البيني",
		"answers": [
			["6", false],
			["24", false],
			["12", true],
			["36", false],
		],		
	},
	{
		"question": "أي مراحل الانقسام المنصف يمثلها الشكل السابق",
		"answers": [
			["القطو التمهيدي الأول", false],
			["الطور الاستوائي الأول", false],
			["القطو التمهيدي الثاني", false],
			["الطور الاستوائي الثاني", true],
		],		
	},
	{
		"question": "ما الخطوة الآتية للكروموسومات في الشكل السابق",
		"answers": [
			["تمر بعملية التضاعف", false],
			["ينخفض عددها إلى النصف في الخلية", false],
			["تمر بعملية الإخصاب", false],
			["تنقسم إلى كروماتيدات شقيقة", true],
		],		
	},
	{
		"question": "ما نسبة الطرز الشكلية الناتجة عن تزاوج أرنب أسود (Bb)مع أرنب أبيض (bb)",
		"answers": [
			["0أسود: 1أبيض", false],
			["1 اسود: 1أبيض", true],
			["1أسود: 0أبيض", false],
			["3اسود: 1أبيض", false],
		],		
	},
	{
		"question": "أي مما يأتي لا يسهم في التنوع الوراثي",
		"answers": [
			["عدد الكروموسومات", true],
			["العبور الجيني", false],
			["الانقسام المنصف", false],
			["التزاوج العشوائي", false],
		],		
	},
	{
		"question": "أي لاختلالات الآتية يعد اختلالا وراثيا سائدا",
		"answers": [
			["المهاق", false],
			["مرض تاي -ساكس", false],
			["التليف الكيسي", false],
			["مرض هنتنجتون", true],
		],		
	},
	{
		"question": "أي مما يأتي لايعد من خصائص الشخص المصاب بالتليف الكيسي",
		"answers": [
			["اختلاف في قنوات أيون الكلور", false],
			["مشكلات هضمية", false],
			["فقدان صبغة الجلد", true],
			["التهاب متكرر في الرئتين", false],
		],		
	},
	{
		"question": "ما عدد كل من الذكور والإناث المصابين في مخطط السلالة السابق",
		"answers": [
			["1ذكر:2 أنثى", false],
			["1ذكر: 1أنثى", false], // TODO: Test this
			["2ذكر: 1أنثى", true],
			["2ذكر: 2أنثى", false],
		],		
	},
	{
		"question": "ما الذي يحدد الجنس في الأنسان",
		"answers": [
			["الكروموسومان XوY", true],
			["الكروموسوم رقم 21", false],
			["السيادة المشتركة", false],
			["التفوق الجيني", false],
		],		
	},
	{
		"question": "ما الطراز الجيني المحتمل لشخص فصيلة دمه A",
		"answers": [
			["IAi", true],
			["IAIB", false],
			["IBIB", false],
			["ii", false],
		],		
	},
	{
		"question": "ما الوحدات البناء الأساسية لكل من DNAوRNA",
		"answers": [
			["الرايبوز", false],
			["النيوكليوتيدات", true],
			["البيورينات", false],
			["الفسفور", false],
		],		
	},
	{
		"question": "بم يبدا بناء سلسلة DNAالجديد",
		"answers": [
			["RNA بادئ", true],
			["RNA الرسول", false],
			["وحدة نيوكليوتيد", false],
			["RNAالناقل", false],
		],		
	},
]

function get_question() {
	if (answered.length == questions.length) {
		alert("ترا ختمت الاسئلة")
		answered = []
		testindex = 0
	}
	if (testmode) {
		return questions[testindex++]
	} else {
		var q = questions[Math.floor(Math.random() * questions.length)];
		if (answered.includes(q)) {
			return get_question()
		}
		return q
	}
}

function on_answer(correct) {
	var question = get_question()
	
	$("#question").empty()

	if (correct) {
		score += 1;
		$(".score").text("النتيجة: " + score)
		$(".score").css("color", "green")
	} else {
		$(".score").text("النتيجة: " + score)
		$(".score").css("color", "red")
	}
	add_question(question)
}

function add_question(question) {
	var question_div = $("#question")
	answered.push(question)

	question_div.append("<h1>" + question.question + "</h1>")
	for (var i of question.answers) {
		if (i[1]) {
			question_div.append("<div><button class='answer' onclick='on_answer(true)'> " + i[0] + "</button></div>")
		} else {
			question_div.append("<div><button class='answer' onclick='on_answer(false)'>" + i[0] + "</button></div>")
		}
	}
}

$(document).ready(function() {
	var question = get_question()

	add_question(question)
})